In [11]:
import pandas as pd
df=pd.read_csv("salary.csv")
df.head()

  Company                  Job     Degree  Salary_more_than_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [12]:
inputs=df.drop("Salary_more_than_100k",axis="columns")
target=df["Salary_more_than_100k"]
inputs

     Company                  Job     Degree
0     google      sales executive  bachelors
1     google      sales executive    masters
2     google     business manager  bachelors
3     google     business manager    masters
4     google  computer programmer  bachelors
5     google  computer programmer    masters
6     amazon      sales executive    masters
7     amazon  computer programmer  bachelors
8     amazon     business manager  bachelors
9     amazon     business manager    masters
10  facebook      sales executive  bachelors
11  facebook      sales executive    masters
12  facebook     business manager  bachelors
13  facebook     business manager    masters
14  facebook  computer programmer  bachelors
15  facebook  computer programmer    masters

In [13]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: Salary_more_than_100k, dtype: int64

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [16]:
inputs['Company_n']=le_company.fit_transform(inputs['Company'])
inputs['Job_n']=le_company.fit_transform(inputs['Job'])
inputs['Degree_n']=le_company.fit_transform(inputs['Degree'])
inputs.head()

  Company                  Job     Degree  Company_n  Job_n  Degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [17]:
inputs_n=inputs.drop(['Company','Job','Degree'],axis='columns')
inputs_n

    Company_n  Job_n  Degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [18]:
from sklearn import tree

In [19]:
model=tree.DecisionTreeClassifier()

In [20]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [21]:
model.score(inputs_n,target)

1.0

In [22]:
model.predict([[2,2,1]])

array([0], dtype=int64)

In [23]:
model.predict([[2,0,1]])

array([1], dtype=int64)